tmp/Tarea_Repaso_03_SimpleScript.tex
% Created 2020-02-11 mar 06:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas}
\date{\today}
\title{UD07 - Repaso - Discos Duros}
\hypersetup{
 pdfauthor={Angel Berlanas},
 pdftitle={UD07 - Repaso - Discos Duros},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Aviso navegantes}
\label{sec:orgbfaf1c9}

Leed atentamente los enunciados. Vale la pena leer el ejercicio hasta el final
antes de pasar a la práctica.

\section{Discos duros - Conectores}
\label{sec:org0386847}

Enumera los conectores disponibles para los discos duros siguientes, indicando
el ancho de banda, así como el número de conectores en la placa que solemos
tener (en placas entre 75 y 100 euros) para cada uno de ellos.

\begin{center}
\begin{tabular}{l}
Conector\\
\hline
IDE\\
SATA 1\\
SATA 2\\
SATA 3\\
M.2\\
\end{tabular}
\end{center}

Para cada uno de ellos indicad de \emph{donde} habéis extraido la información
acerca del ancho de banda.

\section{Discos duros - fsck}
\label{sec:org812e990}

Busca en internet información acerca de \texttt{fsck}. Responde a las siguientes
preguntas.

\begin{itemize}
\item ¿Qué funcion realiza?.
\item ¿Porqué hay que ejecutarlo a veces después de un reinicio \emph{inesperado}?.
\item Trata de ejecutarlo en una Máquina MV sobre la partición de \texttt{/}.¿Qué ocurre?.
\item ¿Cómo lo harías para realizarlo?
\end{itemize}

\section{Discos duros - chkdsk}
\label{sec:orgd389ac4}

Busca en internet información acerca de \texttt{chkdsk}. Responde a las siguientes
preguntas:

\begin{itemize}
\item ¿Qué funcion realiza?.
\item ¿Porqué hay que ejecutarlo a veces después de un reinicio \emph{inesperado}?.
\item ¿Se puede forzar la ejecución en un reinicio?
\end{itemize}
\end{document}
